profiling/stage_3/get_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 37.055ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.326ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 75.017ms, rate sampling interval: 522ms
  Thread calibration: mean lat.: 5.353ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89ms  338.68us   8.64ms   65.68%
    Req/Sec     1.02k   293.44     2.06k    62.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    1.13ms
 90.000%    1.30ms
 99.000%    1.51ms
 99.900%    3.23ms
 99.990%    7.02ms
 99.999%    8.15ms
100.000%    8.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.265     0.000000            2         1.00
       0.470     0.100000         9227         1.11
       0.576     0.200000        18461         1.25
       0.681     0.300000        27701         1.43
       0.782     0.400000        36963         1.67
       0.873     0.500000        46142         2.00
       0.918     0.550000        50791         2.22
       0.965     0.600000        55364         2.50
       1.017     0.650000        60028         2.86
       1.071     0.700000        64650         3.33
       1.133     0.750000        69256         4.00
       1.164     0.775000        71552         4.44
       1.193     0.800000        73851         5.00
       1.222     0.825000        76170         5.71
       1.249     0.850000        78434         6.67
       1.276     0.875000        80784         8.00
       1.290     0.887500        81950         8.89
       1.304     0.900000        83075        10.00
       1.319     0.912500        84230        11.43
       1.336     0.925000        85414        13.33
       1.354     0.937500        86517        16.00
       1.364     0.943750        87121        17.78
       1.375     0.950000        87686        20.00
       1.387     0.956250        88274        22.86
       1.400     0.962500        88845        26.67
       1.415     0.968750        89410        32.00
       1.423     0.971875        89684        35.56
       1.433     0.975000        89980        40.00
       1.442     0.978125        90267        45.71
       1.454     0.981250        90548        53.33
       1.469     0.984375        90833        64.00
       1.479     0.985938        90977        71.11
       1.488     0.987500        91116        80.00
       1.502     0.989062        91262        91.43
       1.519     0.990625        91414       106.67
       1.539     0.992188        91553       128.00
       1.550     0.992969        91622       142.22
       1.568     0.993750        91693       160.00
       1.589     0.994531        91766       182.86
       1.617     0.995313        91838       213.33
       1.666     0.996094        91910       256.00
       1.709     0.996484        91945       284.44
       1.770     0.996875        91981       320.00
       1.835     0.997266        92017       365.71
       1.905     0.997656        92053       426.67
       2.081     0.998047        92089       512.00
       2.255     0.998242        92107       568.89
       2.495     0.998437        92126       640.00
       2.691     0.998633        92143       731.43
       3.029     0.998828        92162       853.33
       3.285     0.999023        92179      1024.00
       3.385     0.999121        92188      1137.78
       3.581     0.999219        92197      1280.00
       3.737     0.999316        92206      1462.86
       3.999     0.999414        92215      1706.67
       4.183     0.999512        92224      2048.00
       4.491     0.999561        92229      2275.56
       4.907     0.999609        92233      2560.00
       5.071     0.999658        92238      2925.71
       5.455     0.999707        92242      3413.33
       5.719     0.999756        92247      4096.00
       5.751     0.999780        92249      4551.11
       6.007     0.999805        92251      5120.00
       6.563     0.999829        92254      5851.43
       6.823     0.999854        92256      6826.67
       6.907     0.999878        92258      8192.00
       6.943     0.999890        92259      9102.22
       7.019     0.999902        92260     10240.00
       7.131     0.999915        92262     11702.86
       7.135     0.999927        92263     13653.33
       7.303     0.999939        92264     16384.00
       7.303     0.999945        92264     18204.44
       7.379     0.999951        92265     20480.00
       7.527     0.999957        92266     23405.71
       7.527     0.999963        92266     27306.67
       7.947     0.999969        92267     32768.00
       7.947     0.999973        92267     36408.89
       7.947     0.999976        92267     40960.00
       8.147     0.999979        92268     46811.43
       8.147     0.999982        92268     54613.33
       8.147     0.999985        92268     65536.00
       8.147     0.999986        92268     72817.78
       8.147     0.999988        92268     81920.00
       8.647     0.999989        92269     93622.86
       8.647     1.000000        92269          inf
#[Mean    =        0.887, StdDeviation   =        0.339]
#[Max     =        8.640, Total count    =        92269]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  182338 requests in 30.00s, 11.61MB read
  Socket errors: connect 7, read 0, write 0, timeout 13320
Requests/sec:   6077.83
Transfer/sec:    396.27KB