profiling/stage_3/put_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.200ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.118ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.915ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  358.83us  16.59ms   67.46%
    Req/Sec   655.76    373.59     1.44k    73.48%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.91ms
 75.000%    1.18ms
 90.000%    1.36ms
 99.000%    1.55ms
 99.900%    2.11ms
 99.990%    8.20ms
 99.999%   16.61ms
100.000%   16.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.292     0.000000            1         1.00
       0.503     0.100000         4658         1.11
       0.609     0.200000         9318         1.25
       0.722     0.300000        13979         1.43
       0.824     0.400000        18633         1.67
       0.913     0.500000        23277         2.00
       0.955     0.550000        25618         2.22
       1.001     0.600000        27949         2.50
       1.054     0.650000        30290         2.86
       1.114     0.700000        32584         3.33
       1.182     0.750000        34909         4.00
       1.216     0.775000        36086         4.44
       1.248     0.800000        37248         5.00
       1.276     0.825000        38415         5.71
       1.303     0.850000        39558         6.67
       1.329     0.875000        40720         8.00
       1.344     0.887500        41335         8.89
       1.357     0.900000        41907        10.00
       1.371     0.912500        42466        11.43
       1.387     0.925000        43057        13.33
       1.406     0.937500        43646        16.00
       1.416     0.943750        43933        17.78
       1.427     0.950000        44227        20.00
       1.438     0.956250        44515        22.86
       1.450     0.962500        44807        26.67
       1.464     0.968750        45082        32.00
       1.473     0.971875        45233        35.56
       1.481     0.975000        45385        40.00
       1.489     0.978125        45521        45.71
       1.501     0.981250        45671        53.33
       1.514     0.984375        45814        64.00
       1.522     0.985938        45887        71.11
       1.531     0.987500        45955        80.00
       1.545     0.989062        46028        91.43
       1.562     0.990625        46100       106.67
       1.580     0.992188        46174       128.00
       1.590     0.992969        46211       142.22
       1.602     0.993750        46249       160.00
       1.614     0.994531        46284       182.86
       1.638     0.995313        46319       213.33
       1.669     0.996094        46356       256.00
       1.680     0.996484        46373       284.44
       1.696     0.996875        46391       320.00
       1.721     0.997266        46409       365.71
       1.749     0.997656        46427       426.67
       1.791     0.998047        46447       512.00
       1.816     0.998242        46455       568.89
       1.866     0.998437        46464       640.00
       1.913     0.998633        46473       731.43
       1.999     0.998828        46482       853.33
       2.145     0.999023        46491      1024.00
       2.211     0.999121        46496      1137.78
       2.261     0.999219        46500      1280.00
       2.347     0.999316        46505      1462.86
       2.819     0.999414        46509      1706.67
       3.427     0.999512        46514      2048.00
       3.669     0.999561        46516      2275.56
       3.779     0.999609        46518      2560.00
       4.027     0.999658        46521      2925.71
       4.663     0.999707        46523      3413.33
       5.623     0.999756        46525      4096.00
       6.435     0.999780        46526      4551.11
       6.775     0.999805        46527      5120.00
       7.115     0.999829        46529      5851.43
       7.755     0.999854        46530      6826.67
       8.199     0.999878        46531      8192.00
       8.199     0.999890        46531      9102.22
       8.343     0.999902        46532     10240.00
      15.191     0.999915        46533     11702.86
      15.191     0.999927        46533     13653.33
      16.199     0.999939        46534     16384.00
      16.199     0.999945        46534     18204.44
      16.199     0.999951        46534     20480.00
      16.591     0.999957        46535     23405.71
      16.591     0.999963        46535     27306.67
      16.591     0.999969        46535     32768.00
      16.591     0.999973        46535     36408.89
      16.591     0.999976        46535     40960.00
      16.607     0.999979        46536     46811.43
      16.607     1.000000        46536          inf
#[Mean    =        0.928, StdDeviation   =        0.359]
#[Max     =       16.592, Total count    =        46536]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  101983 requests in 30.00s, 6.52MB read
  Socket errors: connect 7, read 0, write 0, timeout 13800
Requests/sec:   3399.01
Transfer/sec:    222.40KB